Revit 2027 API
Revolution.Axis Property
Returns the Axis of the Revolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelLine Axis { get; }
Public ReadOnly Property Axis As ModelLine
	Get
public:
property ModelLine^ Axis {
	ModelLine^ get ();
}
member Axis : ModelLine with get
Property Value
ModelLine
Remarks
This property is used to retrieve the Axis of the Revolution.
See Also
Reference
Revolution Class
Autodesk.Revit.DB Namespace